Do any necessary initialisation

In [1]:
import pandas as pd

Load the xyz.csv file from https://gist.githubusercontent.com/ariskou/6441e960da38d395b1305e9d388f92d5/raw/62c459a79631efb35ca7000c3fcdf66d2f4a2cc5/xyz.csv:

In [2]:
xyz=pd.read_csv(r'https://gist.githubusercontent.com/ariskou/6441e960da38d395b1305e9d388f92d5/raw/62c459a79631efb35ca7000c3fcdf66d2f4a2cc5/xyz.csv')

Print the first 3 rows

In [3]:
xyz.head(3)

        x       y         z
0  174.23  294.59  50206.23
1  176.34  264.83  53170.51
2  171.09  250.23  43880.04

Print the last 3 rows

In [4]:
xyz.tail(3)

          x       y         z
297  156.70  306.50  71229.91
298  176.74  218.54  40177.42
299  197.35  354.90  70886.47

## Answer the following questions

1. What are the following values for columns `x` and `y` (but **not** `z`): 
* minimum
* 5th percentile
* 25th percentile (also known as 1st quartile)
* median (also known as 2nd quartile or 50th percentile)
* 75th percentile (also known as 3rd quartile)
* 95th percentile
* maximum

In [5]:

print(xyz.x.describe(percentiles=[0.0005, 0.25, 0.50, 0.75, 0.95]))
print(xyz.y.describe(percentiles=[0.0005, 0.25, 0.50, 0.75, 0.95]))

count    300.000000
mean     175.616800
std       10.877993
min      150.170000
0.05%    150.310530
25%      167.915000
50%      175.325000
75%      183.332500
95%      192.731000
max      211.480000
Name: x, dtype: float64
count    300.000000
mean     304.023233
std      103.896309
min       33.350000
0.05%     35.383200
25%      233.570000
50%      298.830000
75%      373.505000
95%      470.849500
max      635.080000
Name: y, dtype: float64

2. Create a new column named `w` which is the product of the values of `x` and `y`. Print the first 5 rows of the data.

In [6]:
xyz['w'] = (xyz.x*xyz.y)
xyz.head()

        x       y         z           w
0  174.23  294.59  50206.23  51326.4157
1  176.34  264.83  53170.51  46700.1222
2  171.09  250.23  43880.04  42811.8507
3  169.74  216.75  51461.05  36791.1450
4  178.72  392.96  51301.86  70229.8112

3. Find the number of rows where the value of `w` is within one standard deviation from the mean of `w` **AND** where the value of `z` is within (smaller or equal) half a standard deviation from the mean of `z`.

Use the smaller or equal operator (`<=`) for the comparisons.

In [7]:
n=0
w_std=xyz.w.std()
z_std=xyz.z.std()
w_mean=xyz.w.mean()
z_mean=xyz.w.mean()
for idx, row in xyz.iterrows():
    if abs(row.z - z_mean)<= (z_std/2) and abs(row.w - w_mean)<= (w_std):
        n+=1
print(n)

74

In [8]:

for idx, row in xyz.iterrows():
    if abs(row.w - w_mean)<= (w_std):
        xyz.loc[idx,'dev'] = 'one'
    elif abs(row.w - w_mean)<= (2*w_std):
        xyz.loc[idx,'dev'] = 'two'
    elif abs(row.w - w_mean)<= (4*w_std):
        xyz.loc[idx,'dev'] = 'four'  
print(w_std,w_mean)

xyz.head()

18650.209281653126 53412.15204933331

        x       y         z           w  dev
0  174.23  294.59  50206.23  51326.4157  one
1  176.34  264.83  53170.51  46700.1222  one
2  171.09  250.23  43880.04  42811.8507  one
3  169.74  216.75  51461.05  36791.1450  one
4  178.72  392.96  51301.86  70229.8112  one

4. Create a new column named `"devs"` with possible values one of:
* `"four"`, 
* `"two"`, or 
* `"one"` 

The value corresponds to whether the value of `w` (in the same row) is within 4, 2, or 1 standard deviations from the mean of `w`.

Use the smaller or equal operator (`<=`) for the comparisons.

What is the **maximum** of the values of `x` in categories `"one"` and `"two"`?

In [9]:
max=xyz.x.min()
print(max)

150.17

In [10]:
for idx, row in xyz.iterrows():
    if (row.dev=='one' or row.dev=='two')and row.x>max:
        max=row.x

In [11]:
print(max)

211.48

In [12]:
for idx, row in xyz.iterrows():
    if row.x==211.48:
        print(row)

x       211.48
y       262.19
z      52357.8
w      55447.9
dev        one
Name: 210, dtype: object